In [1]:
import pandas as pd

# Creamos un Dataset

In [2]:
df = pd.DataFrame(data={"Pais":['Mexico','Argentina','Espana','Colombia'],
                        "Poblacion":[127212000, 45167000, 47099000, 48922000]})

In [3]:
df

        Pais  Poblacion
0     Mexico  127212000
1  Argentina   45167000
2     Espana   47099000
3   Colombia   48922000

## Ordenamos por columna

In [4]:
df.sort_values(["Poblacion"], ascending=False)

        Pais  Poblacion
0     Mexico  127212000
3   Colombia   48922000
2     Espana   47099000
1  Argentina   45167000

In [5]:
df = df.sort_values(["Pais"])
df

        Pais  Poblacion
1  Argentina   45167000
3   Colombia   48922000
2     Espana   47099000
0     Mexico  127212000

## Agregar una columna

In [6]:
df["Superficie"] = [1964375, 2780400, 505944, 1142748]
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748

### Asigno mismo valor a todas las filas en una columna nueva

In [7]:
df['Deporte']= 'Futbol'
df

        Pais  Poblacion  Superficie Deporte
1  Argentina   45167000     1964375  Futbol
3   Colombia   48922000     2780400  Futbol
2     Espana   47099000      505944  Futbol
0     Mexico  127212000     1142748  Futbol

## Eliminar una columna

In [8]:
df = df.drop(['Deporte'],axis=1)
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748

## Eliminar multiples columnas

In [9]:
df.drop(['Superficie','Pais'], axis=1)

   Poblacion
1   45167000
3   48922000
2   47099000
0  127212000

In [10]:
df # df sigue intacto

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748

## Agregar una fila nueva al final

In [11]:
cantidad_filas = len(df) # obtengo la cantidad de filas
cantidad_filas

4

In [12]:
df.loc[cantidad_filas] = ["Benezuela", 0, 916445] # para cambiar nombre
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748
4  Benezuela          0      916445

### Actualizo la fila entera

In [13]:
df.loc[4] = ["Venezuela", 0, 916445]
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748
4  Venezuela          0      916445

### Actualizo una celda

In [14]:
df.at[4,'Poblacion'] = 32423000
df

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
2     Espana   47099000      505944
0     Mexico  127212000     1142748
4  Venezuela   32423000      916445

## Eliminar una fila

In [15]:
df.drop([3])

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
2     Espana   47099000      505944
0     Mexico  127212000     1142748
4  Venezuela   32423000      916445

## Eliminar multiples filas

In [16]:
df.drop([3,1])

        Pais  Poblacion  Superficie
2     Espana   47099000      505944
0     Mexico  127212000     1142748
4  Venezuela   32423000      916445

# Filtrar

## Paises con mas de 46 millones de habitantes

In [17]:
mas_de_46 = df[ df['Poblacion'] > 46000000 ]
mas_de_46

       Pais  Poblacion  Superficie
3  Colombia   48922000     2780400
2    Espana   47099000      505944
0    Mexico  127212000     1142748

## Más de 46 mill y superficie menor a 600.000 Km2

In [18]:
doble_filtro = df[ (df['Poblacion'] > 46000000) & (df['Superficie'] < 600000) ]
doble_filtro

     Pais  Poblacion  Superficie
2  Espana   47099000      505944

## Busco por un valor específico

In [19]:
por_nombre = df[ df['Pais'] == 'Colombia' ]
por_nombre

       Pais  Poblacion  Superficie
3  Colombia   48922000     2780400

## Paises con nombre mayor a 6 letras

In [20]:
nombre_largo = df[ df['Pais'].str.len() > 6 ]
nombre_largo

        Pais  Poblacion  Superficie
1  Argentina   45167000     1964375
3   Colombia   48922000     2780400
4  Venezuela   32423000      916445

## Obtener el indice de una fila

In [21]:
por_nombre = df[ df['Pais'] == 'Colombia' ]
por_nombre.index.tolist()[0]

3

# Aplicar operaciones entre columnas

In [22]:
# agregamos en una nueva columna el ratio de habitantes por superficie
df['Habit_x_km2'] = (df['Poblacion'] / df['Superficie']).astype(int)
df.sort_values(['Habit_x_km2'])

        Pais  Poblacion  Superficie  Habit_x_km2
3   Colombia   48922000     2780400           17
1  Argentina   45167000     1964375           22
4  Venezuela   32423000      916445           35
2     Espana   47099000      505944           93
0     Mexico  127212000     1142748          111

## Aplicar una operacion definida

In [23]:
def crear_codigo(name):
    name = name.upper() # paso a mayusculas
    name = name[0:4]    # primeros 4 char
    return name

### aplicamos usando 1 columna

In [24]:
df['Codigo'] = df['Pais'].apply(crear_codigo)
df

        Pais  Poblacion  Superficie  Habit_x_km2 Codigo
1  Argentina   45167000     1964375           22   ARGE
3   Colombia   48922000     2780400           17   COLO
2     Espana   47099000      505944           93   ESPA
0     Mexico  127212000     1142748          111   MEXI
4  Venezuela   32423000      916445           35   VENE

# Reordenamos columnas

In [27]:
df = df[ ['Codigo','Pais','Poblacion','Superficie','Habit_x_km2'] ]
df

  Codigo       Pais  Poblacion  Superficie  Habit_x_km2
1   ARGE  Argentina   45167000     1964375           22
3   COLO   Colombia   48922000     2780400           17
2   ESPA     Espana   47099000      505944           93
0   MEXI     Mexico  127212000     1142748          111
4   VENE  Venezuela   32423000      916445           35

In [29]:
# Creamos un DF nuevo, le asignamos el Codigo como identificador único
df_comida = pd.DataFrame(data={
                        "Comida":['Burritos', 'Milanesa', 'Tortilla', 'Sancocho','Arepas']},
                        index = ['MEXI','ARGE','ESPA','COLO','VENE'])
df_comida

        Comida
MEXI  Burritos
ARGE  Milanesa
ESPA  Tortilla
COLO  Sancocho
VENE    Arepas

In [30]:
#asignamos indice en nuestro DF inicial
df_index = df.set_index('Codigo')
df_index

             Pais  Poblacion  Superficie  Habit_x_km2
Codigo
ARGE    Argentina   45167000     1964375           22
COLO     Colombia   48922000     2780400           17
ESPA       Espana   47099000      505944           93
MEXI       Mexico  127212000     1142748          111
VENE    Venezuela   32423000      916445           35

## Adicionar multiples filas desde otra Tabla con Append

In [31]:
#supongamos que tenemos otra tabla:
df_otros = pd.DataFrame(data={"Pais":['Brasil','Chile'],
                        "Poblacion":[210688000, 19241000],
                        "Superficie":[8515770,56102]})
df_otros

     Pais  Poblacion  Superficie
0  Brasil  210688000     8515770
1   Chile   19241000       56102

In [34]:
df1 = df = pd.DataFrame({"a":[1, 2, 3, 4],
                         "b":[5, 6, 7, 8]})

In [35]:
df2 = pd.DataFrame({"a":[1, 2, 3],
                    "b":[5, 6, 7]})

In [38]:
df1 = pd.concat([df1, df2], ignore_index=True)
print(df1)

   a  b
0  1  5
1  2  6
2  3  7
3  4  8
4  1  5
5  2  6
6  3  7
7  1  5
8  2  6
9  3  7

## Agrupar

In [40]:
technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python","NA"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000,1500],
    'Duration':['30days','50days','55days','40days','60days','35days','30days','50days','40days'],
    'Discount':[1000,2300,1000,1200,2500,None,1400,1600,0]
          })
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1000.0
3   Python  24000   40days    1200.0
4   Pandas  26000   60days    2500.0
5   Hadoop  25000   35days       NaN
6    Spark  25000   30days    1400.0
7   Python  22000   50days    1600.0
8       NA   1500   40days       0.0

In [41]:
df2 =df.groupby(['Courses']).sum()
print(df2)

           Fee      Duration  Discount
Courses
Hadoop   48000  55days35days    1000.0
NA        1500        40days       0.0
Pandas   26000        60days    2500.0
PySpark  25000        50days    2300.0
Python   46000  40days50days    2800.0
Spark    47000  30days30days    2400.0

# Basicos!

In [42]:
# Leer un archivo csv
df_csv = pd.read_csv("salary_data.csv")

In [46]:
# Informacion de columnas, tipos de datos y nulos
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  30 non-null     float64
 1   Salary           30 non-null     float64
dtypes: float64(2)
memory usage: 612.0 bytes

In [47]:
# estadísticas sobre las columnas numéricas
df_csv.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [50]:
#ver primeras n filas  (ó ultimas)
df_csv.head(2)

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0

In [49]:
# dimensiones del dataframe (filas, columnas)
df_csv.shape

(30, 2)

In [51]:
#cantidad de filas
len(df_csv)

30

In [54]:
#Iterar un dataframe
for i in range(len(df_csv)):    
    print(df_csv.iloc[i]["Salary"])

39343.0
46205.0
37731.0
43525.0
39891.0
56642.0
60150.0
54445.0
64445.0
57189.0
63218.0
55794.0
56957.0
57081.0
61111.0
67938.0
66029.0
83088.0
81363.0
93940.0
91738.0
98273.0
101302.0
113812.0
109431.0
105582.0
116969.0
112635.0
122391.0
121872.0

In [55]:
# Obtener sumatoria, media y cantidad de una columna
print(df_csv['Salary'].mean())
print(df_csv['Salary'].sum())
print(df_csv['Salary'].count())
print(df_csv['Salary'].min())
print(df_csv['Salary'].max())

76003.0
2280090.0
30
37731.0
122391.0

In [56]:
#acceso a una columna
df_csv.Salary

0      39343.0
1      46205.0
2      37731.0
3      43525.0
4      39891.0
5      56642.0
6      60150.0
7      54445.0
8      64445.0
9      57189.0
10     63218.0
11     55794.0
12     56957.0
13     57081.0
14     61111.0
15     67938.0
16     66029.0
17     83088.0
18     81363.0
19     93940.0
20     91738.0
21     98273.0
22    101302.0
23    113812.0
24    109431.0
25    105582.0
26    116969.0
27    112635.0
28    122391.0
29    121872.0
Name: Salary, dtype: float64

In [58]:
# unicos
df_csv.Salary.unique()

array([ 39343.,  46205.,  37731.,  43525.,  39891.,  56642.,  60150.,
        54445.,  64445.,  57189.,  63218.,  55794.,  56957.,  57081.,
        61111.,  67938.,  66029.,  83088.,  81363.,  93940.,  91738.,
        98273., 101302., 113812., 109431., 105582., 116969., 112635.,
       122391., 121872.])

In [59]:
# cantidad de unicos
len(df_csv.Salary.unique())

30

In [60]:
# contabilizar por una columna
pd.value_counts(df_csv['YearsExperience'], sort = True)

YearsExperience
3.2     2
4.0     2
1.1     1
5.3     1
10.3    1
9.6     1
9.5     1
9.0     1
8.7     1
8.2     1
7.9     1
7.1     1
6.8     1
6.0     1
5.9     1
5.1     1
1.3     1
4.9     1
4.5     1
4.1     1
3.9     1
3.7     1
3.0     1
2.9     1
2.2     1
2.0     1
1.5     1
10.5    1
Name: count, dtype: int64

In [62]:
# Obtener ultima fila
df_csv.iloc[-1]

YearsExperience        10.5
Salary             121872.0
Name: 29, dtype: float64

In [63]:
# obtener primera columna
df_csv.iloc[:,0]

0      1.1
1      1.3
2      1.5
3      2.0
4      2.2
5      2.9
6      3.0
7      3.2
8      3.2
9      3.7
10     3.9
11     4.0
12     4.0
13     4.1
14     4.5
15     4.9
16     5.1
17     5.3
18     5.9
19     6.0
20     6.8
21     7.1
22     7.9
23     8.2
24     8.7
25     9.0
26     9.5
27     9.6
28    10.3
29    10.5
Name: YearsExperience, dtype: float64

In [64]:
# Busco por indice
df_csv.loc[2]

YearsExperience        1.5
Salary             37731.0
Name: 2, dtype: float64

In [65]:
df_csv.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [67]:
# obtner una columna dentro de una condicion
df_csv.loc[ df_csv['YearsExperience'] < 3 ,["Salary"]]

    Salary
0  39343.0
1  46205.0
2  37731.0
3  43525.0
4  39891.0
5  56642.0

In [68]:
# Modificar Valor con loc
df_csv.loc[ df_csv['YearsExperience'] < 3 ,["Salary"]] = 150000
df_csv

    YearsExperience    Salary
0               1.1  150000.0
1               1.3  150000.0
2               1.5  150000.0
3               2.0  150000.0
4               2.2  150000.0
5               2.9  150000.0
6               3.0   60150.0
7               3.2   54445.0
8               3.2   64445.0
9               3.7   57189.0
10              3.9   63218.0
11              4.0   55794.0
12              4.0   56957.0
13              4.1   57081.0
14              4.5   61111.0
15              4.9   67938.0
16              5.1   66029.0
17              5.3   83088.0
18              5.9   81363.0
19              6.0   93940.0
20              6.8   91738.0
21              7.1   98273.0
22              7.9  101302.0
23              8.2  113812.0
24              8.7  109431.0
25              9.0  105582.0
26              9.5  116969.0
27              9.6  112635.0
28             10.3  122391.0
29             10.5  121872.0

In [69]:
for index in range(df_csv.shape[1]):
    print('Índice de la columna: ', index)
    print('Contenido de la columna: ', df_csv.iloc[: , index].values)

Índice de la columna:  0
Contenido de la columna:  [ 1.1  1.3  1.5  2.   2.2  2.9  3.   3.2  3.2  3.7  3.9  4.   4.   4.1
  4.5  4.9  5.1  5.3  5.9  6.   6.8  7.1  7.9  8.2  8.7  9.   9.5  9.6
 10.3 10.5]
Índice de la columna:  1
Contenido de la columna:  [150000. 150000. 150000. 150000. 150000. 150000.  60150.  54445.  64445.
  57189.  63218.  55794.  56957.  57081.  61111.  67938.  66029.  83088.
  81363.  93940.  91738.  98273. 101302. 113812. 109431. 105582. 116969.
 112635. 122391. 121872.]

In [70]:
for column in df_csv:
    print('Nombre de la columna: ', column)
    print('Contenido de la columna: ', df_csv[column].values)

Nombre de la columna:  YearsExperience
Contenido de la columna:  [ 1.1  1.3  1.5  2.   2.2  2.9  3.   3.2  3.2  3.7  3.9  4.   4.   4.1
  4.5  4.9  5.1  5.3  5.9  6.   6.8  7.1  7.9  8.2  8.7  9.   9.5  9.6
 10.3 10.5]
Nombre de la columna:  Salary
Contenido de la columna:  [150000. 150000. 150000. 150000. 150000. 150000.  60150.  54445.  64445.
  57189.  63218.  55794.  56957.  57081.  61111.  67938.  66029.  83088.
  81363.  93940.  91738.  98273. 101302. 113812. 109431. 105582. 116969.
 112635. 122391. 121872.]

In [73]:
for i in range(len(df_csv)):
    for column in df_csv:
        print(df_csv.at[i,column])

1.1
150000.0
1.3
150000.0
1.5
150000.0
2.0
150000.0
2.2
150000.0
2.9
150000.0
3.0
60150.0
3.2
54445.0
3.2
64445.0
3.7
57189.0
3.9
63218.0
4.0
55794.0
4.0
56957.0
4.1
57081.0
4.5
61111.0
4.9
67938.0
5.1
66029.0
5.3
83088.0
5.9
81363.0
6.0
93940.0
6.8
91738.0
7.1
98273.0
7.9
101302.0
8.2
113812.0
8.7
109431.0
9.0
105582.0
9.5
116969.0
9.6
112635.0
10.3
122391.0
10.5
121872.0